# Built In Failures Family Failures Insert Orientation Changed To Be Valid Property

Source: https://www.revitapidocs.com/2026/527a8be5-b439-6f0a-bdfe-f03a0ec031a0.htm

---

| Built In Failures Family Failures Insert Orientation Changed To Be Valid Property |
| --- |

The insert orientation was modified to be compatible with the wall's cross\-section.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId InsertOrientationChangedToBeValid { get; }
```

```
Public Shared ReadOnly Property InsertOrientationChangedToBeValid As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ InsertOrientationChangedToBeValid {
	FailureDefinitionId^ get ();
}
```

```
static member InsertOrientationChangedToBeValid : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures FamilyFailures Class Autodesk.Revit.DB Namespace